test_cases/3d_water/3d_mobyDick/0_mobyDick_snappyHexMesh/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.0.1 |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}

convertToMeters 1.0e0;   // STL file is in m

// Bounding box just large enough to capture STL
vertices
(
	(  0  0  0)
	(120  0  0)
	(120  9  0)
	(  0  9  0)
	(  0  0  9)
	(120  0  9)
	(120  9  9)
	(  0  9  9)
);

blocks
(
      hex (0 1 2 3 4 5 6 7) (240 18 18) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
      allBoundary
      {
            type patch;
            faces (
                  (0 1 2 3)
		  (4 5 6 7)
		  (7 6 2 3)
   	          (4 5 1 0)
		  (0 3 7 4)
		  (1 2 6 5)
            );
      }

      // For OF-2.x , comment out in OF-1.6-ext
      inlet
      {
            type patch;
            faces (
            );
      }

      // For OF-2.x , comment out in OF-1.6-ext
      outlet
      {
            type patch;
            faces (
            );
      }

      walls
      {
	    type wall;
	    faces (
	    );
      }
);

mergePatchPairs
(
);
